Configuration/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РезультатыСпециальнойОценкиУсловийТруда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассУсловийТруда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыявленыВредныеОпасныеФакторы</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Documents/РезультатыСпецоценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РезультатыСпецоценкиУсловийТруда</Name>
			<BasedOn>
				<xr:Item>Document.ПодготовкаСпецоценкиУсловийТруда</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеДатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.РезультатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.УдалитьРезультатыСпециальнойОценкиУсловийТруда</xr:Item>
				<xr:Item>InformationRegister.УдалитьПлановыеДатыСпециальнойОценкиУсловийТруда</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаСпецоценкиУсловийТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРезультатов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредставлениеРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассУсловийТруда</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыявленыВредныеОпасныеФакторы</Name>
							<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рекомендации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналогичныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАналогичноеМесто</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналогичноеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/InformationRegisters/РезультатыСпециальнойОценкиУсловийТруда/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегистраПодчиненногоРегистратору(Настройки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновления

// Параметры:
//  ПараметрыОбновления - Структура - параметры обработчика обновления.
Процедура ЗаполнитьВыявленныеВредныеФакторыСОУТ(ПараметрыОбновления) Экспорт

	ВредныеКлассы = КлассыУсловийТрудаКлиентСервер.ВредныеИОпасныеКлассыУсловийТруда();

	Запрос = Новый Запрос;
	
	// АПК:96-выкл Использование ОБЪЕДИНИТЬ оправдано
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВредныеФакторы.Ссылка КАК Регистратор,
	|	РабочиеМеста.РабочееМесто КАК РабочееМесто
	|ПОМЕСТИТЬ ВТВредныеРабочиеМестаСОУТ
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.ВредныеФакторы КАК ВредныеФакторы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РабочиеМеста
	|		ПО РабочиеМеста.Ссылка = ВредныеФакторы.Ссылка
	|			И РабочиеМеста.ИдентификаторСтрокиРабочегоМеста = ВредныеФакторы.ИдентификаторСтрокиРабочегоМеста
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АналогичныеМеста.Ссылка,
	|	АналогичныеМеста.АналогичноеМесто
	|ИЗ
	|	Документ.РезультатыСпецоценкиУсловийТруда.АналогичныеМеста КАК АналогичныеМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.РабочиеМеста КАК РабочиеМеста
	|		ПО РабочиеМеста.Ссылка = АналогичныеМеста.Ссылка
	|			И РабочиеМеста.ИдентификаторСтрокиРабочегоМеста = АналогичныеМеста.ИдентификаторСтрокиРабочегоМеста
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РезультатыСпецоценкиУсловийТруда.ВредныеФакторы КАК ВредныеФакторы
	|		ПО ВредныеФакторы.Ссылка = АналогичныеМеста.Ссылка
	|			И ВредныеФакторы.ИдентификаторСтрокиРабочегоМеста = РабочиеМеста.ИдентификаторСтрокиРабочегоМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Результаты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК Результаты
	|ГДЕ
	|	НЕ Результаты.ВыявленыВредныеОпасныеФакторы
	|	И Результаты.КлассУсловийТруда В (&ВредныеКлассы)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Результаты.Регистратор
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда КАК Результаты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВредныеРабочиеМестаСОУТ КАК ВТВредныеРабочиеМестаСОУТ
	|		ПО ВТВредныеРабочиеМестаСОУТ.Регистратор = Результаты.Регистратор
	|			И ВТВредныеРабочиеМестаСОУТ.РабочееМесто = Результаты.РабочееМесто
	|ГДЕ
	|	НЕ Результаты.ВыявленыВредныеОпасныеФакторы";
	// АПК:96-вкл

	Запрос.УстановитьПараметр("ВредныеКлассы", ВредныеКлассы);

	ОбновляемыеДанные = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ВыполнитьЗапросПолученияОбновляемыхДанных(
		Запрос, ПараметрыОбновления);

	Если ОбновляемыеДанные.Пустой() Тогда
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбработчик(ПараметрыОбновления);
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПродолжитьОбработчик(ПараметрыОбновления);

	ВыборкаРегистраторов = ОбновляемыеДанные.Выбрать();
	Пока ВыборкаРегистраторов.Следующий() Цикл
		Регистратор = ВыборкаРегистраторов.Регистратор;

		НачатьТранзакцию();
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", Регистратор);
			ЭлементБлокировки = Блокировка.Добавить("Документ.РезультатыСпецоценкиУсловийТруда");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Регистратор);
			Блокировка.Заблокировать();

			// 1. Заполняем флаг в ТЧ РабочиеМеста документа.
			ДокументОбъект = Регистратор.ПолучитьОбъект();

			ИдентификаторыСВреднымиФакторами = Новый Соответствие;
			ФлагиПоИдентификаторам = Новый Соответствие;
			ФлагиПоРабочимМестам = Новый Соответствие;
			Для Каждого СтрокаВФ Из ДокументОбъект.ВредныеФакторы Цикл
				ИдентификаторыСВреднымиФакторами.Вставить(СтрокаВФ.ИдентификаторСтрокиРабочегоМеста, Истина);
			КонецЦикла;

			ЕстьИзмененияДокумента = Ложь;
			Для Каждого СтрокаРМ Из ДокументОбъект.РабочиеМеста Цикл
				Если ВредныеКлассы.Найти(СтрокаРМ.КлассУсловийТруда) <> Неопределено Тогда
					ВыявленыВредныеФакторы = Истина;
				ИначеЕсли ИдентификаторыСВреднымиФакторами.Получить(СтрокаРМ.ИдентификаторСтрокиРабочегоМеста) <> Неопределено Тогда
					ВыявленыВредныеФакторы = Истина;
				Иначе
					ВыявленыВредныеФакторы = Ложь;
				КонецЕсли;
				Если СтрокаРМ.ВыявленыВредныеОпасныеФакторы <> ВыявленыВредныеФакторы Тогда
					СтрокаРМ.ВыявленыВредныеОпасныеФакторы = ВыявленыВредныеФакторы;
					ЕстьИзмененияДокумента = Истина;
				КонецЕсли;
				ФлагиПоИдентификаторам.Вставить(СтрокаРМ.ИдентификаторСтрокиРабочегоМеста, ВыявленыВредныеФакторы);
				ФлагиПоРабочимМестам.Вставить(СтрокаРМ.РабочееМесто, ВыявленыВредныеФакторы);
			КонецЦикла;

			Для Каждого СтрокаАналогичногоМеста Из ДокументОбъект.АналогичныеМеста Цикл
				ФлагВредныхФакторов = ФлагиПоИдентификаторам.Получить(СтрокаАналогичногоМеста.ИдентификаторСтрокиРабочегоМеста);
				Если ФлагВредныхФакторов = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ФлагиПоРабочимМестам.Вставить(СтрокаАналогичногоМеста.АналогичноеМесто, ФлагВредныхФакторов);
			КонецЦикла;

			Если ЕстьИзмененияДокумента Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
			КонецЕсли;

			// 2. Обновляем набор записей регистра.
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
			НаборЗаписей.Прочитать();

			Для Каждого Запись Из НаборЗаписей Цикл
				ФлагВредныхФакторов = ФлагиПоРабочимМестам.Получить(Запись.РабочееМесто);
				Если ФлагВредныхФакторов = Неопределено Тогда
					ФлагВредныхФакторов = ВредныеКлассы.Найти(Запись.КлассУсловийТруда) <> Неопределено;
				КонецЕсли;
				Запись.ВыявленыВредныеОпасныеФакторы = ФлагВредныхФакторов;
			КонецЦикла;

			НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьБизнесЛогикуПриЗаписи");
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);

			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Ошибка,
				Метаданные.РегистрыСведений.РезультатыСпециальнойОценкиУсловийТруда, ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
